local ќд∆чњв = {
	ќд∆ч_њ’ ÷ = 100,
    ќд∆ч_≥§љ£ = 101,
    ќд∆ч_ћЂµґ = 102,
    ќд∆ч_јЂµґ = 103,
    ќд∆ч_’ґ¬нµґ = 119,
    ќд∆ч_≥§«є = 105,
    ќд∆ч_єч = 120,
    ќд∆ч_Ў∞ „ = 106,
    ќд∆ч_ЋЂµґ = 118,
    ќд∆ч_ЋЂк™ = 121,
    ќд∆ч_…» = 122,
    ќд∆ч_Їбµґ = 123,
    ќд∆ч_ЋЂљЏєч = 116,
	ќд∆ч_»≠»– = 124,
    ќд∆ч_ƒсп• = 113,
    ќд∆ч_є≠Љэ = 104,
    ќд∆ч_їр≈Џ = 109,
    ќд∆ч_ќе—џп• = 112,
    ќд∆ч_Ѕђеу = 108,
    ќд∆ч_їр…с = 110,
    ќд∆ч_Ѕч–«”к = 111,
	ќд∆ч∆Ј÷ √ы„÷={
		[3200001] = "∞„≥§љ£", [3200011] = "јґ≥§љ£", [3200021] = "„ѕ≥§љ£", [3200031] = "љр≥§љ£",
		[3200300] = "∞„ћЂµґ", [3200310] = "јґћЂµґ", [3200320] = "„ѕћЂµґ", [3200330] = "љрћЂµґ",
		[3200400] = "∞„јЂµґ", [3200410] = "јґјЂµґ", [3200420] = "„ѕјЂµґ", [3200430] = "љрјЂµґ",
		[3200200] = "∞„≥§«є", [3200210] = "јґ≥§«є", [3200220] = "„ѕ≥§«є", [3200230] = "љр≥§«є",
		[3201200] = "∞„ƒсп•", [3201210] = "јґƒсп•", [3201220] = "„ѕƒсп•", [3201230] = "љрƒсп•",
		[3200501] = "∞„є≠Љэ", [3200511] = "јґє≠Љэ", [3200521] = "„ѕє≠Љэ", [3200531] = "љрє≠Љэ",
		[3200800] = "∞„їр≈Џ", [3200810] = "јґїр≈Џ", [3200820] = "„ѕїр≈Џ", [3200830] = "љрїр≈Џ",
		[3201100] = "∞„ќе—џп•", [3201110] = "јґќе—џп•", [3201120] = "„ѕќе—џп•", [3201130] = "љрќе—џп•",
		[3200700] = "∞„Ѕђеу", [3200710] = "јґЅђеу", [3200720] = "„ѕЅђеу", [3200730] = "љрЅђеу",
		[3200900] = "∞„їр…с", [3200910] = "јґїр…с", [3200920] = "„ѕїр…с", [3200930] = "љрїр…с",
		[3201000] = "∞„Ѕч–«”к", [3201010] = "јґЅч–«”к", [3201020] = "„ѕЅч–«”к", [3201030] = "љрЅч–«”к",
		[3200101] = "∞„Ў∞ „", [3200111] = "јґЎ∞ „", [3200121] = "„ѕЎ∞ „", [3200131] = "љрЎ∞ „",
		[3201510] = "∞„љЏєч", [3201520] = "јґљЏєч", [3201530] = "„ѕљЏєч", [3201540] = "љрљЏєч",
		[3201610] = "∞„ЋЂµґ", [3201620] = "јґЋЂµґ", [3201630] = "„ѕЋЂµґ", [3201640] = "љрЋЂµґ",
		[3201810] = "∞„єч", [3201820] = "јґєч", [3201830] = "„ѕєч", [3201840] = "љрєч",
		[3201710] = "∞„’ґ¬нµґ", [3201720] = "јґ’ґ¬нµґ", [3201730] = "„ѕ’ґ¬нµґ", [3201740] = "љр’ґ¬нµґ",
		[3201910] = "∞„ЋЂк™", [3201920] = "јґЋЂк™", [3201930] = "„ѕЋЂк™", [3201940] = "љрЋЂк™",
		[3202010] = "∞„…»", [3202020] = "јґ…»", [3202030] = "„ѕ…»", [3202040] = "љр…»",
		[3202210] = "∞„Їбµґ", [3202220] = "јґЇбµґ", [3202230] = "„ѕЇбµґ", [3202240] = "љрЇбµґ",
		[3202310] = "∞„»≠»–", [3202320] = "јґ»≠»–", [3202330] = "„ѕ»≠»–", [3202340] = "љр»≠»–",
		[3209901] = "∞„њ’ ÷"
	},
	ќд∆ч—’…Ђ÷µ={
		["∞„"]={r=1.0,g=1.0,b=1.0,a=1.0},
		["јґ"]={r=0.2,g=0.6,b=0.7,a=1.0},
		["„ѕ"]={r=0.5,g=0.0,b=0.5,a=1.0},
		["љр"]={r=1.0,g=0.647,b=0.0,a=1.0}
	}
}
local ќд∆ч±аЇ≈”≥…д = {
    [3200001] = ќд∆чњв.ќд∆ч_≥§љ£, [3200011] = ќд∆чњв.ќд∆ч_≥§љ£, [3200021] = ќд∆чњв.ќд∆ч_≥§љ£, [3200031] = ќд∆чњв.ќд∆ч_≥§љ£,
    [3200300] = ќд∆чњв.ќд∆ч_ћЂµґ, [3200310] = ќд∆чњв.ќд∆ч_ћЂµґ, [3200320] = ќд∆чњв.ќд∆ч_ћЂµґ, [3200330] = ќд∆чњв.ќд∆ч_ћЂµґ,
    [3200400] = ќд∆чњв.ќд∆ч_јЂµґ, [3200410] = ќд∆чњв.ќд∆ч_јЂµґ, [3200420] = ќд∆чњв.ќд∆ч_јЂµґ, [3200430] = ќд∆чњв.ќд∆ч_јЂµґ,
    [3200200] = ќд∆чњв.ќд∆ч_≥§«є, [3200210] = ќд∆чњв.ќд∆ч_≥§«є, [3200220] = ќд∆чњв.ќд∆ч_≥§«є, [3200230] = ќд∆чњв.ќд∆ч_≥§«є,
    [3201200] = ќд∆чњв.ќд∆ч_ƒсп•, [3201210] = ќд∆чњв.ќд∆ч_ƒсп•, [3201220] = ќд∆чњв.ќд∆ч_ƒсп•, [3201230] = ќд∆чњв.ќд∆ч_ƒсп•,
    [3200501] = ќд∆чњв.ќд∆ч_є≠Љэ, [3200511] = ќд∆чњв.ќд∆ч_є≠Љэ, [3200521] = ќд∆чњв.ќд∆ч_є≠Љэ, [3200531] = ќд∆чњв.ќд∆ч_є≠Љэ,
    [3200800] = ќд∆чњв.ќд∆ч_їр≈Џ, [3200810] = ќд∆чњв.ќд∆ч_їр≈Џ, [3200820] = ќд∆чњв.ќд∆ч_їр≈Џ, [3200830] = ќд∆чњв.ќд∆ч_їр≈Џ,
    [3201100] = ќд∆чњв.ќд∆ч_ќе—џп•, [3201110] = ќд∆чњв.ќд∆ч_ќе—џп•, [3201120] = ќд∆чњв.ќд∆ч_ќе—џп•, [3201130] = ќд∆чњв.ќд∆ч_ќе—џп•,
    [3200700] = ќд∆чњв.ќд∆ч_Ѕђеу, [3200710] = ќд∆чњв.ќд∆ч_Ѕђеу, [3200720] = ќд∆чњв.ќд∆ч_Ѕђеу, [3200730] = ќд∆чњв.ќд∆ч_Ѕђеу,
    [3200900] = ќд∆чњв.ќд∆ч_їр…с, [3200910] = ќд∆чњв.ќд∆ч_їр…с, [3200920] = ќд∆чњв.ќд∆ч_їр…с, [3200930] = ќд∆чњв.ќд∆ч_їр…с,
    [3201000] = ќд∆чњв.ќд∆ч_Ѕч–«”к, [3201010] = ќд∆чњв.ќд∆ч_Ѕч–«”к, [3201020] = ќд∆чњв.ќд∆ч_Ѕч–«”к, [3201030] = ќд∆чњв.ќд∆ч_Ѕч–«”к,
    [3200101] = ќд∆чњв.ќд∆ч_Ў∞ „, [3200111] = ќд∆чњв.ќд∆ч_Ў∞ „, [3200121] = ќд∆чњв.ќд∆ч_Ў∞ „, [3200131] = ќд∆чњв.ќд∆ч_Ў∞ „,
    [3201510] = ќд∆чњв.ќд∆ч_ЋЂљЏєч, [3201520] = ќд∆чњв.ќд∆ч_ЋЂљЏєч, [3201530] = ќд∆чњв.ќд∆ч_ЋЂљЏєч, [3201540] = ќд∆чњв.ќд∆ч_ЋЂљЏєч,
    [3201610] = ќд∆чњв.ќд∆ч_ЋЂµґ, [3201620] = ќд∆чњв.ќд∆ч_ЋЂµґ, [3201630] = ќд∆чњв.ќд∆ч_ЋЂµґ, [3201640] = ќд∆чњв.ќд∆ч_ЋЂµґ,
    [3201810] = ќд∆чњв.ќд∆ч_єч, [3201820] = ќд∆чњв.ќд∆ч_єч, [3201830] = ќд∆чњв.ќд∆ч_єч, [3201840] = ќд∆чњв.ќд∆ч_єч,
    [3201710] = ќд∆чњв.ќд∆ч_’ґ¬нµґ, [3201720] = ќд∆чњв.ќд∆ч_’ґ¬нµґ, [3201730] = ќд∆чњв.ќд∆ч_’ґ¬нµґ, [3201740] = ќд∆чњв.ќд∆ч_’ґ¬нµґ,
	[3201910] = ќд∆чњв.ќд∆ч_ЋЂк™, [3201920] = ќд∆чњв.ќд∆ч_ЋЂк™, [3201930] = ќд∆чњв.ќд∆ч_ЋЂк™, [3201940] = ќд∆чњв.ќд∆ч_ЋЂк™,
    [3202010] = ќд∆чњв.ќд∆ч_…», [3202020] = ќд∆чњв.ќд∆ч_…», [3202030] = ќд∆чњв.ќд∆ч_…», [3202040] = ќд∆чњв.ќд∆ч_…»,
    [3202210] = ќд∆чњв.ќд∆ч_Їбµґ, [3202220] = ќд∆чњв.ќд∆ч_Їбµґ, [3202230] = ќд∆чњв.ќд∆ч_Їбµґ, [3202240] = ќд∆чњв.ќд∆ч_Їбµґ,
	[3202310] = ќд∆чњв.ќд∆ч_»≠»–, [3202320] = ќд∆чњв.ќд∆ч_»≠»–, [3202330] = ќд∆чњв.ќд∆ч_»≠»–, [3202340] = ќд∆чњв.ќд∆ч_»≠»–,
    [3209901] = ќд∆чњв.ќд∆ч_њ’ ÷
	-- “‘іЋјаЌ∆£ђќ™√њЄц±аЇ≈ћнЉ””≥…д£ђ»зєы”ќѕЈЄь–¬Їу£ђњ…ƒ№їб”––¬µƒќд∆ч£ђЉћ–шЌщјп√жћнЉ”Љіњ…
}


function ќд∆чњв.»°ќд∆чЈ÷ја(≤ќ_±аЇ≈)
    return ќд∆ч±аЇ≈”≥…д[≤ќ_±аЇ≈] or 0 -- »зєы±аЇ≈≤їіж‘Џ”Џ”≥…д±н÷–£ђЈµїЎ0
end
function ќд∆чњв. «љь’љќд∆ч(ќд∆чја–Ќ)
	local љь’љќд∆ч={
		ќд∆ч_≥§љ£ = 101,
		ќд∆ч_ћЂµґ = 102,
		ќд∆ч_јЂµґ = 103,
		ќд∆ч_’ґ¬нµґ = 119,
		ќд∆ч_≥§«є = 105,
		ќд∆ч_єч = 120,
		ќд∆ч_Ў∞ „ = 106,
		ќд∆ч_ЋЂµґ = 118,
		ќд∆ч_ЋЂк™ = 121,
		ќд∆ч_…» = 122,
		ќд∆ч_Їбµґ = 123,
		ќд∆ч_ЋЂљЏєч = 116,
		ќд∆ч_»≠»– = 124
	}
	for index, ќд∆ч in pairs(љь’љќд∆ч) do
		if ќд∆чја–Ќ==ќд∆ч then return true end
	end
	return false
end
return ќд∆чњв

